app/controllers/comments_controller.rb

INSERT INTO `comments` (`email`, `name`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('piyuesh23@gmail.com', 'test1', 'testtvhvsd kjvbsdyhbsd', 1, '2011-08-03 14:33:31', '2011-08-03 14:33:31')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy