app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('test', 'test', '2011-08-03 12:20:02', '2011-08-03 12:20:02')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `image_file_name` = 'HD_Wallpaper_225.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 328681, `image_updated_at` = '2011-08-03 12:54:20', `updated_at` = '2011-08-03 12:54:20' WHERE `posts`.`id` = 1